org/cross-domain.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-11-03 Tue 09:36>
#+TITLE: Cross Domain

→ 本文摘录自 [[http://www.ruanyifeng.com/blog/2016/04/same-origin-policy.html][浏览器同源政策及其规避方法]]

** 什么是跨域

_跨域_ ，是指浏览器不能执行其他网站的脚本，它是浏览器的同源策略造成的，是浏览器对 JavaScript 实施的安全限制。

那么，什么是同源策略呢？

_同源策略_ 是由 Netscape 公司于 1995 年引入浏览器的，目前，所有浏览器都实行这个策略。同源策略的目的，是为了保证用户信息的安全，防止恶意的网站窃取数据。

最初，它的含义是，A 网页设置的 Cookie ，B 网页不能打开，除非这两个网页“同源” -- _协议相同、域名相同、端口相同_ 。

#+BEGIN_EXPORT html
<note>
Cookie 往往用来保存用户的登录状态，所以“同源策略”是必需的，否则 Cookie 可以共享，互联网就毫无安全可言了。
</note>
#+END_EXPORT

随着互联网的发展，“同源策略”越来越严格。目前，如果非同源，共有三种行为受到限制：
1. Cookie、LocalStorage 和 IndexDB 无法读取；
2. DOM 无法获得；
3. AJAX 请求不能发送。

跨域的限制当然是有必要的，但实际应用过程中也常常需要在保证相对安全的情况下规避上述的三种限制。

** Cookie

Cookie 是服务器写入浏览器的一小段信息，只有同源网页才能共享。但是，如果两个网页的一级域名相同，只是二级域名不同，浏览器允许通过设置 =document.domain= 共享 Cookie 。

举例来说，A 网页是 =http://w1.example.com/a.html= ，B 网页是 =http://w2.example.com/b.html= ，那么只要设置相同的 =document.domain= ，两个网页就可以共享 Cookie 。

#+BEGIN_SRC js
  document.domain = 'example.com';
#+END_SRC

现在，A 网页通过脚本设置一个 Cookie ：

#+BEGIN_SRC js
  document.cookie = "test1=hello";
#+END_SRC

B 网页就可以读到这个 Cookie ：

#+BEGIN_SRC js
  var allCookie = document.cookie;
#+END_SRC

*注：这种方法只适用于 Cookie 和 iframe 窗口，LocalStorage 和 IndexDB 无法通过这种方法（要使用 PostMessage API）。

另外，服务器也可以在设置 Cookie 的时候，指定 Cookie 的所属域名为一级域名，比如 =.example.com= ：

#+BEGIN_EXAMPLE
Set-Cookie: key=value; domain=.example.com; path=/
#+END_EXAMPLE

如此，二级域名和三级域名不用做任何设置，都可以读取这个 Cookie 。

** iframe

如果两个网页不同源，就无法拿到对方的 DOM ，典型的例子是 =iframe= 窗口和 =window.open= 方法打开的窗口，它们与父窗口无法通信。

如果两个窗口一级域名相同，只是二级域名不同，那么设置 =document.domain= 属性，就可以规避同源策略，拿到 DOM 。

对于完全不同源的网站，目前有三种方法，可以解决跨域窗口的通信问题：
- 片段识别符（fragment identifier）；
- window.name ；
- 跨文档通信 API （Cross-document messaging）。

*** 片段识别符

_片段识别符_ （fragment identifier），是指 URL 的 =#= 号后面的部分，如 =http://example.com/x.html#fragment= 的 =#fragment= 。如果，只是改变片段识别符，页面不会重新刷新。

父窗口可以把信息，写入子窗口的片段识别符，如下：

#+BEGIN_SRC js -n
  var src = originURL + '#' + data;
  document.getElementById('myIFrame').src = src;
#+END_SRC

子窗口通过监听 =hashchange= 事件得到通知，如下：

#+BEGIN_SRC js -n
  window.onhashchange = checkMessage;

  function checkMessage() {
      var message = window.location.hash;
      // ...
  }
#+END_SRC

同样的，子窗口也可以改变父窗口的片段标识符：

#+BEGIN_SRC js
  parent.location.href = target + '#' + hash;
#+END_SRC

*** window.name

浏览器窗口有 =window.name= 属性，它的最大特点是，无论是否同源，只要在同一个窗口里，前一个网页设置了这个属性，后一个网页就可以读取它。

来看一个具体的例子吧。

父窗口先打开一个子窗口，载入一个不同源的网页，该网页将信息写入 =window.name= 属性，如下：

#+BEGIN_SRC js
  window.name = data;
#+END_SRC

接着，子窗口跳回一个与主窗口同域的网址：

#+BEGIN_SRC js
location = 'http://parent.url.com/xxx.html';
#+END_SRC

然后，主窗口就可以读取子窗口的 =window.name= 了：

#+BEGIN_SRC js
  var data = document.getElementById('myFrame').contentWindow.name;
#+END_SRC

这种方法的优点是， =window.name= 容量很大，可以放置非常长的字符串；缺点是必须监听子窗口 =window.name= 属性的变化，影响网页性能。

#+BEGIN_EXPORT html
<essay>
不强制兼容 IE 的话，实在不想碰这玩意儿...
</essay>
#+END_EXPORT

