public/cross-domain.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-03 Tue 12:38 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Cross Domain</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Cross Domain</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3edf0e4">什么是跨域</a></li>
<li><a href="#org797b50b">Cookie</a></li>
<li><a href="#org153b55f">iframe</a>
<ul>
<li><a href="#org2b6e510">片段识别符</a></li>
<li><a href="#org3d1792c">window.name</a></li>
<li><a href="#org7803c30">window.postMessage</a></li>
</ul>
</li>
<li><a href="#org3504bdb">AJAX</a>
<ul>
<li><a href="#org1df0b52">JSONP</a></li>
<li><a href="#org691f0db">WebSocket</a></li>
<li><a href="#org52b5de4">CORS</a></li>
</ul>
</li>
<li><a href="#org907204a"><span class="todo TODO">TODO</span> CORS 详解</a></li>
</ul>
</div>
</div>
<p>
→ 本文摘录自 <a href="http://www.ruanyifeng.com/blog/2016/04/same-origin-policy.html">浏览器同源政策及其规避方法</a>
</p>

<div id="outline-container-org3edf0e4" class="outline-2">
<h2 id="org3edf0e4">什么是跨域</h2>
<div class="outline-text-2" id="text-org3edf0e4">
<p>
<span class="underline">跨域</span> ，是指浏览器不能执行其他网站的脚本，它是浏览器的同源策略造成的，是浏览器对 JavaScript 实施的安全限制。
</p>

<p>
那么，什么是同源策略呢？
</p>

<p>
<span class="underline">同源策略</span> 是由 Netscape 公司于 1995 年引入浏览器的，目前，所有浏览器都实行这个策略。同源策略的目的，是为了保证用户信息的安全，防止恶意的网站窃取数据。
</p>

<p>
最初，它的含义是，A 网页设置的 Cookie ，B 网页不能打开，除非这两个网页“同源” &#x2013; <span class="underline">协议相同、域名相同、端口相同</span> 。
</p>

<note>
Cookie 往往用来保存用户的登录状态，所以“同源策略”是必需的，否则 Cookie 可以共享，互联网就毫无安全可言了。
</note>

<p>
随着互联网的发展，“同源策略”越来越严格。目前，如果非同源，共有三种行为受到限制：
</p>
<ol class="org-ol">
<li>Cookie、LocalStorage 和 IndexDB 无法读取；</li>
<li>DOM 无法获得；</li>
<li>AJAX 请求不能发送。</li>
</ol>

<p>
跨域的限制当然是有必要的，但实际应用过程中也常常需要在保证相对安全的情况下规避上述的三种限制。
</p>
</div>
</div>

<div id="outline-container-org797b50b" class="outline-2">
<h2 id="org797b50b">Cookie</h2>
<div class="outline-text-2" id="text-org797b50b">
<p>
Cookie 是服务器写入浏览器的一小段信息，只有同源网页才能共享。但是，如果两个网页的一级域名相同，只是二级域名不同，浏览器允许通过设置 <code>document.domain</code> 共享 Cookie 。
</p>

<p>
举例来说，A 网页是 <code>http://w1.example.com/a.html</code> ，B 网页是 <code>http://w2.example.com/b.html</code> ，那么只要设置相同的 <code>document.domain</code> ，两个网页就可以共享 Cookie 。
</p>

<div class="org-src-container">
<pre class="src src-js">document.domain = <span style="color: #E6DB74;">'example.com'</span>;
</pre>
</div>

<p>
现在，A 网页通过脚本设置一个 Cookie ：
</p>

<div class="org-src-container">
<pre class="src src-js">document.cookie = <span style="color: #E6DB74;">"test1=hello"</span>;
</pre>
</div>

<p>
B 网页就可以读到这个 Cookie ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">allCookie</span> = document.cookie;
</pre>
</div>

<p>
*注：这种方法只适用于 Cookie 和 iframe 窗口，LocalStorage 和 IndexDB 无法通过这种方法（要使用 PostMessage API）。
</p>

<p>
另外，服务器也可以在设置 Cookie 的时候，指定 Cookie 的所属域名为一级域名，比如 <code>.example.com</code> ：
</p>

<pre class="example">
Set-Cookie: key=value; domain=.example.com; path=/
</pre>

<p>
如此，二级域名和三级域名不用做任何设置，都可以读取这个 Cookie 。
</p>
</div>
</div>

<div id="outline-container-org153b55f" class="outline-2">
<h2 id="org153b55f">iframe</h2>
<div class="outline-text-2" id="text-org153b55f">
<p>
如果两个网页不同源，就无法拿到对方的 DOM ，典型的例子是 <code>iframe</code> 窗口和 <code>window.open</code> 方法打开的窗口，它们与父窗口无法通信。
</p>

<p>
如果两个窗口一级域名相同，只是二级域名不同，那么设置 <code>document.domain</code> 属性，就可以规避同源策略，拿到 DOM 。
</p>

<p>
对于完全不同源的网站，目前有三种方法，可以解决跨域窗口的通信问题：
</p>
<ul class="org-ul">
<li>片段识别符（fragment identifier）；</li>
<li>window.name ；</li>
<li>跨文档通信 API （Cross-document messaging）。</li>
</ul>
</div>

<div id="outline-container-org2b6e510" class="outline-3">
<h3 id="org2b6e510">片段识别符</h3>
<div class="outline-text-3" id="text-org2b6e510">
<p>
<span class="underline">片段识别符</span> （fragment identifier），是指 URL 的 <code>#</code> 号后面的部分，如 <code>http://example.com/x.html#fragment</code> 的 <code>#fragment</code> 。如果，只是改变片段识别符，页面不会重新刷新。
</p>

<p>
父窗口可以把信息，写入子窗口的片段识别符，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">src</span> = originURL + <span style="color: #E6DB74;">'#'</span> + data;
<span class="linenr">2: </span>document.getElementById<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'myIFrame'</span><span style="color: #AE81FF;">)</span>.src = src;
</pre>
</div>

<p>
子窗口通过监听 <code>hashchange</code> 事件得到通知，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>window.onhashchange = checkMessage;
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">checkMessage</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">4: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">message</span> = window.location.hash;
<span class="linenr">5: </span>    <span style="color: #75715E;">// </span><span style="color: #75715E;">...</span>
<span class="linenr">6: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
同样的，子窗口也可以改变父窗口的片段标识符：
</p>

<div class="org-src-container">
<pre class="src src-js">parent.location.href = target + <span style="color: #E6DB74;">'#'</span> + hash;
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d1792c" class="outline-3">
<h3 id="org3d1792c">window.name</h3>
<div class="outline-text-3" id="text-org3d1792c">
<p>
浏览器窗口有 <code>window.name</code> 属性，它的最大特点是，无论是否同源，只要在同一个窗口里，前一个网页设置了这个属性，后一个网页就可以读取它。
</p>

<p>
来看一个具体的例子吧。
</p>

<p>
父窗口先打开一个子窗口，载入一个不同源的网页，该网页将信息写入 <code>window.name</code> 属性，如下：
</p>

<div class="org-src-container">
<pre class="src src-js">window.name = data;
</pre>
</div>

<p>
接着，子窗口跳回一个与主窗口同域的网址：
</p>

<div class="org-src-container">
<pre class="src src-js">location = <span style="color: #E6DB74;">'http://parent.url.com/xxx.html'</span>;
</pre>
</div>

<p>
然后，主窗口就可以读取子窗口的 <code>window.name</code> 了：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #F92672;">var</span> <span style="color: #FD971F;">data</span> = document.getElementById<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'myFrame'</span><span style="color: #AE81FF;">)</span>.contentWindow.name;
</pre>
</div>

<p>
这种方法的优点是， <code>window.name</code> 容量很大，可以放置非常长的字符串；缺点是必须监听子窗口 <code>window.name</code> 属性的变化，影响网页性能。
</p>

<essay>
不强制兼容 IE 的话，实在不想碰这玩意儿...
</essay>
</div>
</div>
