org/cross-domain.org
*** window.postMessage

片段识别符和 =window.name= 两种方法都属于破解，HTML5 为了解决这个问题，引入了一个全新的 API -- 跨文档通信 API （Cross-document messaging）。

这个 API 为 =window= 对象新增了一个 =window.postMessage= 方法，允许跨窗口通信，不论这两个窗口是否同源。

父窗口 =http://aaa.com= 向子窗口 =http://bbb.com= 发消息，调用 =postMessage= 方法就可以了，如下：

#+BEGIN_SRC js -n
  var popup = window.open('http://bbb.com', 'title');
  popup.postMessage('Hello World!', 'http://bbb.com');
#+END_SRC

其中， =postMessage= 方法的第一个参数是具体的信息内容，第二个参数是接收消息的窗口的源（origin），即“协议 + 域名 + 端口”，也可以设为 =*= ，表示不限制域名，向所有窗口发送。

子窗口向父窗口发送消息的写法类似：

#+BEGIN_SRC js -n
  window.opener.postMessage('Nice to see you', 'http://aaa.com');
#+END_SRC

父窗口和子窗口都可以通过 =message= 事件，监听对方的消息：

#+BEGIN_SRC js -n
  window.addEventListener('message', function(e) {
      console.log(e.data);
  }, false);
#+END_SRC

#+BEGIN_QUOTE
=message= 事件的事件对象 =event= ，提供了以下三个属性：
- =event.source= ：发送消息的窗口；
- =event.origin= ：消息发向的网址；
- =event.data= ：消息内容。
#+END_QUOTE

下面的例子是，子窗口通过 =event.source= 属性引用父窗口，然后发消息，如下：

#+BEGIN_SRC js -n
  window.addEventListener('message', receiveMessage);

  function receiveMessage(event) {
      event.source.postMessage('Nice to see you!', '*');
  }
#+END_SRC

=event.origin= 属性可以过滤不是发给本窗口的消息：

#+BEGIN_SRC js -n
  window.addEventListener('message', receiveMessage);

  function receiveMessage(event) {
      if (event.origin !== 'http://aaa.com') return;
      if (event.data === 'Hello World') {
          event.source.postMessage('Hello', event.origin);
      } else {
          console.log(event.data);
      }
  }
#+END_SRC

*通过 =window.postMessage= ，读写其他窗口的 LocalStorage 也成为了可能。*

例如，主窗口写入 iframe 子窗口的 =localStorage= ：

#+BEGIN_SRC js -n
  window.onmessage = function(e) {
      if (e.origin !== 'http://bbb.com') {
          return;
      }

      var payload = JSON.parse(e.data);
      localStorage.setItem(payload.key, JSON.stringfy(payload.data)); // ?? payload.data
  }
#+END_SRC

其中，父窗口发送消息的代码如下：

#+BEGIN_SRC js -n
  var win = document.getElementByTagName('iframe')[0].contentWindow;
  var obj = { name: 'Jack' };

  win.postMessage(JSON.stringfy({ key: 'storage', data: obj }), 'http://bbb.com');
#+END_SRC

#+BEGIN_EXPORT html
<essay>
下面来个加强版的...
</essay>
#+END_EXPORT

#+BEGIN_SRC js -n
  // 加强版的父窗口发消息 ///
  var win = doucment.getElementByTagName('iframe')[0].contentWindow;
  var obj = { name: 'Jack' };
  // 存入对象
  win.postMessage(JSON.stringfy({ key: 'storage', method: 'set', data: obj }), 'http://bbb.com');
  // 读取对象
  win.postMessage(JSON.stringfy({ key: 'storage', method: 'get'}), '*');

  window.onmessage = function(e) {
      if (e.origin != 'http://aaa.com') return;
      console.log(JSON.parse(e.data).name); // → "Jack"
  }
#+END_SRC

#+BEGIN_SRC js -n
  // 加强版的子窗口接收消息 ///
  window.onmessage = function(e) {
      if (e.origin !== 'http://bbb.com') return;
      var payload = JSON.parse(e.data);
      switch (payload.method) {
          case 'set':
              localStorage.setItem(payload.key, JSON.stringfy(payload.data));
              break;
          case 'get':
              var parent = window.parent;
              var data = localStorage.getItem(payload.key);
              parent.postMessage(data, 'http://aaa.com');
              break;
          case 'remove':
              localStorage.removeItem(payload.key);
              break;
      }
  }
#+END_SRC

