public/cross-domain.html

<div id="outline-container-org7803c30" class="outline-3">
<h3 id="org7803c30">window.postMessage</h3>
<div class="outline-text-3" id="text-org7803c30">
<p>
片段识别符和 <code>window.name</code> 两种方法都属于破解，HTML5 为了解决这个问题，引入了一个全新的 API &#x2013; 跨文档通信 API （Cross-document messaging）。
</p>

<p>
这个 API 为 <code>window</code> 对象新增了一个 <code>window.postMessage</code> 方法，允许跨窗口通信，不论这两个窗口是否同源。
</p>

<p>
父窗口 <code>http://aaa.com</code> 向子窗口 <code>http://bbb.com</code> 发消息，调用 <code>postMessage</code> 方法就可以了，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">popup</span> = window.open<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'http://bbb.com'</span>, <span style="color: #E6DB74;">'title'</span><span style="color: #AE81FF;">)</span>;
<span class="linenr">2: </span>popup.postMessage<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Hello World!'</span>, <span style="color: #E6DB74;">'http://bbb.com'</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<p>
其中， <code>postMessage</code> 方法的第一个参数是具体的信息内容，第二个参数是接收消息的窗口的源（origin），即“协议 + 域名 + 端口”，也可以设为 <code>*</code> ，表示不限制域名，向所有窗口发送。
</p>

<p>
子窗口向父窗口发送消息的写法类似：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>window.opener.postMessage<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Nice to see you'</span>, <span style="color: #E6DB74;">'http://aaa.com'</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<p>
父窗口和子窗口都可以通过 <code>message</code> 事件，监听对方的消息：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'message'</span>, <span style="color: #F92672;">function</span><span style="color: #66D9EF;">(</span><span style="color: #FD971F;">e</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr">2: </span>    console.log<span style="color: #A6E22E;">(</span>e.data<span style="color: #A6E22E;">)</span>;
<span class="linenr">3: </span><span style="color: #66D9EF;">}</span>, <span style="color: #AE81FF;">false</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<blockquote>
<p>
<code>message</code> 事件的事件对象 <code>event</code> ，提供了以下三个属性：
</p>
<ul class="org-ul">
<li><code>event.source</code> ：发送消息的窗口；</li>
<li><code>event.origin</code> ：消息发向的网址；</li>
<li><code>event.data</code> ：消息内容。</li>
</ul>
</blockquote>

<p>
下面的例子是，子窗口通过 <code>event.source</code> 属性引用父窗口，然后发消息，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'message'</span>, receiveMessage<span style="color: #AE81FF;">)</span>;
<span class="linenr">2: </span>
<span class="linenr">3: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">receiveMessage</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">event</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">4: </span>    event.source.postMessage<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'Nice to see you!'</span>, <span style="color: #E6DB74;">'*'</span><span style="color: #66D9EF;">)</span>;
<span class="linenr">5: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
<code>event.origin</code> 属性可以过滤不是发给本窗口的消息：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>window.addEventListener<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'message'</span>, receiveMessage<span style="color: #AE81FF;">)</span>;
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">receiveMessage</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">event</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 4: </span>    <span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>event.origin !== <span style="color: #E6DB74;">'http://aaa.com'</span><span style="color: #66D9EF;">)</span> <span style="color: #F92672;">return</span>;
<span class="linenr"> 5: </span>    <span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>event.data === <span style="color: #E6DB74;">'Hello World'</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 6: </span>        event.source.postMessage<span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">'Hello'</span>, event.origin<span style="color: #A6E22E;">)</span>;
<span class="linenr"> 7: </span>    <span style="color: #66D9EF;">}</span> <span style="color: #F92672;">else</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 8: </span>        console.log<span style="color: #A6E22E;">(</span>event.data<span style="color: #A6E22E;">)</span>;
<span class="linenr"> 9: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">10: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
<b>通过 <code>window.postMessage</code> ，读写其他窗口的 LocalStorage 也成为了可能。</b>
</p>

<p>
例如，主窗口写入 iframe 子窗口的 <code>localStorage</code> ：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>window.onmessage = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">e</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">2: </span>    <span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>e.origin !== <span style="color: #E6DB74;">'http://bbb.com'</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr">3: </span>        <span style="color: #F92672;">return</span>;
<span class="linenr">4: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">5: </span>
<span class="linenr">6: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">payload</span> = JSON.parse<span style="color: #66D9EF;">(</span>e.data<span style="color: #66D9EF;">)</span>;
<span class="linenr">7: </span>    localStorage.setItem<span style="color: #66D9EF;">(</span>payload.key, JSON.stringfy<span style="color: #A6E22E;">(</span>payload.data<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">?? payload.data</span>
<span class="linenr">8: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
其中，父窗口发送消息的代码如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">win</span> = document.getElementByTagName<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'iframe'</span><span style="color: #AE81FF;">)[</span>0<span style="color: #AE81FF;">]</span>.contentWindow;
<span class="linenr">2: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = <span style="color: #AE81FF;">{</span> name: <span style="color: #E6DB74;">'Jack'</span> <span style="color: #AE81FF;">}</span>;
<span class="linenr">3: </span>
<span class="linenr">4: </span>win.postMessage<span style="color: #AE81FF;">(</span>JSON.stringfy<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">{</span> key: <span style="color: #E6DB74;">'storage'</span>, data: obj <span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>, <span style="color: #E6DB74;">'http://bbb.com'</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<essay>
下面来个加强版的...
</essay>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#21152;&#24378;&#29256;&#30340;&#29238;&#31383;&#21475;&#21457;&#28040;&#24687; ///</span>
<span class="linenr"> 2: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">win</span> = doucment.getElementByTagName<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'iframe'</span><span style="color: #AE81FF;">)[</span>0<span style="color: #AE81FF;">]</span>.contentWindow;
<span class="linenr"> 3: </span><span style="color: #F92672;">var</span> <span style="color: #FD971F;">obj</span> = <span style="color: #AE81FF;">{</span> name: <span style="color: #E6DB74;">'Jack'</span> <span style="color: #AE81FF;">}</span>;
<span class="linenr"> 4: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#23384;&#20837;&#23545;&#35937;</span>
<span class="linenr"> 5: </span>win.postMessage<span style="color: #AE81FF;">(</span>JSON.stringfy<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">{</span> key: <span style="color: #E6DB74;">'storage'</span>, method: <span style="color: #E6DB74;">'set'</span>, data: obj <span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>, <span style="color: #E6DB74;">'http://bbb.com'</span><span style="color: #AE81FF;">)</span>;
<span class="linenr"> 6: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#35835;&#21462;&#23545;&#35937;</span>
<span class="linenr"> 7: </span>win.postMessage<span style="color: #AE81FF;">(</span>JSON.stringfy<span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">{</span> key: <span style="color: #E6DB74;">'storage'</span>, method: <span style="color: #E6DB74;">'get'</span><span style="color: #A6E22E;">}</span><span style="color: #66D9EF;">)</span>, <span style="color: #E6DB74;">'*'</span><span style="color: #AE81FF;">)</span>;
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>window.onmessage = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">e</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">10: </span>    <span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>e.origin != <span style="color: #E6DB74;">'http://aaa.com'</span><span style="color: #66D9EF;">)</span> <span style="color: #F92672;">return</span>;
<span class="linenr">11: </span>    console.log<span style="color: #66D9EF;">(</span>JSON.parse<span style="color: #A6E22E;">(</span>e.data<span style="color: #A6E22E;">)</span>.name<span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">&#8594; "Jack"</span>
<span class="linenr">12: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #75715E;">// </span><span style="color: #75715E;">&#21152;&#24378;&#29256;&#30340;&#23376;&#31383;&#21475;&#25509;&#25910;&#28040;&#24687; ///</span>
<span class="linenr"> 2: </span>window.onmessage = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">e</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 3: </span>    <span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>e.origin !== <span style="color: #E6DB74;">'http://bbb.com'</span><span style="color: #66D9EF;">)</span> <span style="color: #F92672;">return</span>;
<span class="linenr"> 4: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">payload</span> = JSON.parse<span style="color: #66D9EF;">(</span>e.data<span style="color: #66D9EF;">)</span>;
<span class="linenr"> 5: </span>    <span style="color: #F92672;">switch</span> <span style="color: #66D9EF;">(</span>payload.method<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
<span class="linenr"> 6: </span>        <span style="color: #F92672;">case</span> <span style="color: #E6DB74;">'set'</span>:
<span class="linenr"> 7: </span>            localStorage.setItem<span style="color: #A6E22E;">(</span>payload.key, JSON.stringfy<span style="color: #E6DB74;">(</span>payload.data<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>;
<span class="linenr"> 8: </span>            <span style="color: #F92672;">break</span>;
<span class="linenr"> 9: </span>        <span style="color: #F92672;">case</span> <span style="color: #E6DB74;">'get'</span>:
<span class="linenr">10: </span>            <span style="color: #F92672;">var</span> <span style="color: #FD971F;">parent</span> = window.parent;
<span class="linenr">11: </span>            <span style="color: #F92672;">var</span> <span style="color: #FD971F;">data</span> = localStorage.getItem<span style="color: #A6E22E;">(</span>payload.key<span style="color: #A6E22E;">)</span>;
<span class="linenr">12: </span>            parent.postMessage<span style="color: #A6E22E;">(</span>data, <span style="color: #E6DB74;">'http://aaa.com'</span><span style="color: #A6E22E;">)</span>;
<span class="linenr">13: </span>            <span style="color: #F92672;">break</span>;
<span class="linenr">14: </span>        <span style="color: #F92672;">case</span> <span style="color: #E6DB74;">'remove'</span>:
<span class="linenr">15: </span>            localStorage.removeItem<span style="color: #A6E22E;">(</span>payload.key<span style="color: #A6E22E;">)</span>;
<span class="linenr">16: </span>            <span style="color: #F92672;">break</span>;
<span class="linenr">17: </span>    <span style="color: #66D9EF;">}</span>
<span class="linenr">18: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
</div>
