org/cross-domain.org
** AJAX

同源政策规定，AJAX 请求只能发给同源的网址，否则就报错。

除了架设服务器代理（浏览器请求同源服务器，再由后者请求外部服务），有三种方法规避这个限制： _JSONP、WebSocket、CORS_ 。

#+BEGIN_EXPORT html
<note>
这里架设的服务器是用来代理客户端的，是正向代理。
</note>
#+END_EXPORT

*** JSONP

JSONP是服务器与客户端跨源通信的常用方法。最大特点就是简单适用，老式浏览器全部支持，服务器改造非常小。

*JSONP 的基本思想是什么？*

原来，网页通过添加一个 =<script>= 元素，向服务器请求 JSON 数据的做法是不受同源策略限制的；服务器收到请求后，将数据放在一个指定名字的回调函数里传回来。

首先，网页动态插入 =<script>= 元素，由它向跨源网址发出请求，如下：

#+BEGIN_SRC js -n
  function addScriptTag(src) {
      var script = doucment.createElement('script');
      script.setAttribute('type', 'text/javascript');
      script.src = src;
      document.body.appendChild(script);
  }

  window.onload = function() {
      addScriptTag('http://example.com/jp?callback=foo');
  }

  function foo(data) {
      console.log('Your public IP address is: ' + data.ip);
  }
#+END_SRC

上述代码通过动态添加 =<script>= 元素，向服务器 =example.com= 发出请求。

**注：该请求的查询字符串有一个 =callback= 参数，用来指定回调函数的名字，在对于 JSONP 是必需的。*

服务器收到这个请求后，会将数据放在回调函数的参数位置返回，如下：

#+BEGIN_SRC js -n
  foo({
      'ip': '8.8.8.8'
  });
#+END_SRC

由于 =<script>= 元素请求的脚本，直接作为代码运行。这时，只要浏览器定义了 =foo= 函数，该函数就会立即调用。作为参数的 JSON 数据被视为 JavaScript 对象，而不是字符串，因此避免了使用 =JSON.parse= 的步骤。

*** WebSocket

WebSocket 是一种通信协议，使用 =ws://= （非加密）和 =wss://= （加密）作为协议前缀。该协议不实行同源策略，只要服务器支持，就可以通过它进行跨源通信。

来看个例子，下面是浏览器发出的 WebSocket 请求的头信息：

#+BEGIN_EXAMPLE
  GET /chat HTTP/1.1
  Host: server.example.com
  Upgrade: websocket
  Connection: Upgrade
  Sec-WebSocket-Key: x3JJHMbDL1EzLkh9GBhXDw==
  Sec-WebSocket-Protocol: chat, superchat
  Sec-WebSocket-Version: 13
  Origin: http://example.com
#+END_EXAMPLE

其中， =Origin= 表示该请求的请求源（origin），即发自哪个域名。

#+BEGIN_QUOTE
正是因为有了 =Origin= 这个字段，WebSocket 才没有实行同源策略，因为服务器可以根据这个字段，判断是否允许本次通信。
#+END_QUOTE

如果该域名在白名单内，服务器就会做出如下响应：

#+BEGIN_EXAMPLE
  HTTP/1.1 101 Switching Protocols
  Upgrade: websocket
  Connection: Upgrade
  Sec-WebSocket-Accept: HSmrc0sMlYUkAGmm5OPpG2HaGWk=
  Sec-WebSocket-Protocol: chat
#+END_EXAMPLE

*** CORS

CORS （Cross-Origin Resource Sharing）是跨域资源分享的缩写，它是 W3C 标准，是 *跨源 AJAX 请求的根本解决办法* 。相比 JSONP 只能发 =GET= 请求，CORS 允许任何类型的请求。

** TODO CORS 详解

CORS 允许浏览器向跨源服务器，发出 =XMLHttpRequest= 请求，从而克服了 AJAX 只能同源使用的限制。接下来，我们来深入认识下 CORS 的内部机制。

