public/cross-domain.html

<div id="outline-container-org3504bdb" class="outline-2">
<h2 id="org3504bdb">AJAX</h2>
<div class="outline-text-2" id="text-org3504bdb">
<p>
同源政策规定，AJAX 请求只能发给同源的网址，否则就报错。
</p>

<p>
除了架设服务器代理（浏览器请求同源服务器，再由后者请求外部服务），有三种方法规避这个限制： <span class="underline">JSONP、WebSocket、CORS</span> 。
</p>

<note>
这里架设的服务器是用来代理客户端的，是正向代理。
</note>
</div>

<div id="outline-container-org1df0b52" class="outline-3">
<h3 id="org1df0b52">JSONP</h3>
<div class="outline-text-3" id="text-org1df0b52">
<p>
JSONP是服务器与客户端跨源通信的常用方法。最大特点就是简单适用，老式浏览器全部支持，服务器改造非常小。
</p>

<p>
<b>JSONP 的基本思想是什么？</b>
</p>

<p>
原来，网页通过添加一个 <code>&lt;script&gt;</code> 元素，向服务器请求 JSON 数据的做法是不受同源策略限制的；服务器收到请求后，将数据放在一个指定名字的回调函数里传回来。
</p>

<p>
首先，网页动态插入 <code>&lt;script&gt;</code> 元素，由它向跨源网址发出请求，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">addScriptTag</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">src</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #F92672;">var</span> <span style="color: #FD971F;">script</span> = doucment.createElement<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'script'</span><span style="color: #66D9EF;">)</span>;
<span class="linenr"> 3: </span>    script.setAttribute<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'type'</span>, <span style="color: #E6DB74;">'text/javascript'</span><span style="color: #66D9EF;">)</span>;
<span class="linenr"> 4: </span>    script.src = src;
<span class="linenr"> 5: </span>    document.body.appendChild<span style="color: #66D9EF;">(</span>script<span style="color: #66D9EF;">)</span>;
<span class="linenr"> 6: </span><span style="color: #AE81FF;">}</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>window.onload = <span style="color: #F92672;">function</span><span style="color: #AE81FF;">()</span> <span style="color: #AE81FF;">{</span>
<span class="linenr"> 9: </span>    addScriptTag<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'http://example.com/jp?callback=foo'</span><span style="color: #66D9EF;">)</span>;
<span class="linenr">10: </span><span style="color: #AE81FF;">}</span>
<span class="linenr">11: </span>
<span class="linenr">12: </span><span style="color: #F92672;">function</span> <span style="color: #A6E22E;">foo</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">data</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">{</span>
<span class="linenr">13: </span>    console.log<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">'Your public IP address is: '</span> + data.ip<span style="color: #66D9EF;">)</span>;
<span class="linenr">14: </span><span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
上述代码通过动态添加 <code>&lt;script&gt;</code> 元素，向服务器 <code>example.com</code> 发出请求。
</p>

<p>
<b>*注：该请求的查询字符串有一个 <code>callback</code> 参数，用来指定回调函数的名字，在对于 JSONP 是必需的。</b>
</p>

<p>
服务器收到这个请求后，会将数据放在回调函数的参数位置返回，如下：
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="linenr">1: </span>foo<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">{</span>
<span class="linenr">2: </span>    <span style="color: #E6DB74;">'ip'</span>: <span style="color: #E6DB74;">'8.8.8.8'</span>
<span class="linenr">3: </span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>

<p>
由于 <code>&lt;script&gt;</code> 元素请求的脚本，直接作为代码运行。这时，只要浏览器定义了 <code>foo</code> 函数，该函数就会立即调用。作为参数的 JSON 数据被视为 JavaScript 对象，而不是字符串，因此避免了使用 <code>JSON.parse</code> 的步骤。
</p>
</div>
</div>

<div id="outline-container-org691f0db" class="outline-3">
<h3 id="org691f0db">WebSocket</h3>
<div class="outline-text-3" id="text-org691f0db">
<p>
WebSocket 是一种通信协议，使用 <code>ws://</code> （非加密）和 <code>wss://</code> （加密）作为协议前缀。该协议不实行同源策略，只要服务器支持，就可以通过它进行跨源通信。
</p>

<p>
来看个例子，下面是浏览器发出的 WebSocket 请求的头信息：
</p>

<pre class="example">
GET /chat HTTP/1.1
Host: server.example.com
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Key: x3JJHMbDL1EzLkh9GBhXDw==
Sec-WebSocket-Protocol: chat, superchat
Sec-WebSocket-Version: 13
Origin: http://example.com
</pre>

<p>
其中， <code>Origin</code> 表示该请求的请求源（origin），即发自哪个域名。
</p>

<blockquote>
<p>
正是因为有了 <code>Origin</code> 这个字段，WebSocket 才没有实行同源策略，因为服务器可以根据这个字段，判断是否允许本次通信。
</p>
</blockquote>

<p>
如果该域名在白名单内，服务器就会做出如下响应：
</p>

<pre class="example">
HTTP/1.1 101 Switching Protocols
Upgrade: websocket
Connection: Upgrade
Sec-WebSocket-Accept: HSmrc0sMlYUkAGmm5OPpG2HaGWk=
Sec-WebSocket-Protocol: chat
</pre>
</div>
</div>

<div id="outline-container-org52b5de4" class="outline-3">
<h3 id="org52b5de4">CORS</h3>
<div class="outline-text-3" id="text-org52b5de4">
<p>
CORS （Cross-Origin Resource Sharing）是跨域资源分享的缩写，它是 W3C 标准，是 <b>跨源 AJAX 请求的根本解决办法</b> 。相比 JSONP 只能发 <code>GET</code> 请求，CORS 允许任何类型的请求。
</p>
</div>
</div>
</div>

<div id="outline-container-org907204a" class="outline-2">
<h2 id="org907204a"><span class="todo TODO">TODO</span> CORS 详解</h2>
<div class="outline-text-2" id="text-org907204a">
<p>
CORS 允许浏览器向跨源服务器，发出 <code>XMLHttpRequest</code> 请求，从而克服了 AJAX 只能同源使用的限制。接下来，我们来深入认识下 CORS 的内部机制。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-11-03 Tue 09:36</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-11-03 Tue 12:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
